{
    "gpa" : "3.42",
    "img" : "/files/Pongsakorn_Transcript.png",
    "suggestGrade" : [
        {
            "name" : "PROBLEM SOLVING IN INFORMATION TECHNOLOGY",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับภาษาโปรแกรมมิ่งในชั้นปีที่ 1 เทอม 1 โดยเรียนเกี่ยวกับภาษา Python ซึ่งเป็นภาษาแรกที่เริ่มเรียนแบบจริงจังเลย ทำให้เข้าใจหลัก Algorithm ต่าง ๆ ของการเขียนโปรแกรม",
            "grade" : "A"
        },
        {
            "name" : "OBJECT-ORIENTED PROGRAMMING",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับภาษาโปรแกรมมิ่งในชั้นปีที่ 2 เทอม 1 โดยเรียนภาษา Java ซึ่งทำให้เข้าใจหลัก OOP ต่าง ๆ ที่ใช้ในการเขียนโปรแกรม",
            "grade" : "A"
        },
        {
            "name" : "MULTIMEDIA PROGRAMMING",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับงานเว็บไซต์ในชั้นปีที่ 3 เทอม 1 โดยเรียนภาษา HTML, CSS, JavaScript และ Responsive เป็นต้น",
            "grade" : "A"
        },
        {
            "name" : "GAME DESIGN AND DEVELOPMENT",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับงานเกมในชั้นปีที่ 3 เทอม 1 โดยเรียนผ่านโปรแกรม Unreal Engine ทำให้เข้าใจพื้นฐานในการสร้างเกมต่าง ๆ",
            "grade" : "A"
        },
        {
            "name" : "WEB DESIGN AND DEVELOPMENT",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับงานเว็บไซต์ในชั้นปีที่ 3 เทอม 2 โดยเรียนการสร้างเว็บไซต์ และลองใช้ Firebase เป็น Web app และ Database เพื่อทำเกม Multiplayer ซึ่งเป็นเกมแรกบนเว็บไซต์ในชีวิตผมเลย",
            "grade" : "A"
        },
        {
            "name" : "ADVANCED GAME DEVELOPMENT",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับงานเกมในชั้นปีที่ 3 เทอม 2 โดยเป็นการเรียนต่อจากวิชา GAME DESIGN AND DEVELOPMENT โดยเรียนสูงและยากขึ้น เช่น AI, Cinematic และ Effect เป็นต้น",
            "grade" : "A"
        },
        {
            "name" : "FUNDIMENTALS OF DIGITAL STORYTELLING AND CINEMATOGRAPHY",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับงานการเล่าเรื่องราวในชั้นปีที่ 3 เทอม 2 โดยเรียนการลำดับเรื่องราว การจัดมุมกล้องต่าง ๆ และการสื่อสารผ่านการเล่าเรื่องราว ทำให้การดูหนังของผมไม่เป็นเหมือนเดิมอีกเลย ทำให้ตอนดูก็ต้องวิเคราห์ฉาก มุมกล้องต่าง ๆ ที่อยู่ซีรีส์หรือหนัง",
            "grade" : "A"
        },
        {
            "name" : "SPECIAL TOPICS IN SOFTWARE ENGINEERING 2 (FULL-STACK WEB DEVELOPER)",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับงานเว็บไซต์ในชั้นปีที่ 3 เทอม 2 ซึ่งเป็นวิชาเลือก โดยเรียนการการเป็น Full-stack ของ Web รู้จัก Front-end และ Back-end ในการพัฒนา ทำให้รู้จักการใช้ React จนได้ทำการพัฒนาเว็บไซต์นี้ขึ้นมา",
            "grade" : "A"
        },
        {
            "name" : "COOPERATIVE EDUCATION IN MULTIMEDIA AND GAME DEVELOPMENT",
            "detail": "เป็นวิชาที่เรียนเกี่ยวกับงานสหกิจในชั้นปีที่ 4 เทอม 1 โดยเป็นการฝึกงานที่บริษัท Innova Interactive Studio ทำให้เข้าใจระบบการทำงานในชีวิตจริง และสามารถนำความรู้ไปปรับใช้ในทำงานได้",
            "grade" : "A"
        }
    ]
}